ОперативныеЗадачиКР/src/Documents/ПродажаКомпьютера/ПродажаКомпьютера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаКомпьютера</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ГотовыеКомпьютеры</registerRecords>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>CatalogRef.Компьютеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
</mdclass:Document>

ОперативныеЗадачиКР/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>CatalogRef.Компьютеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СпецификацияКомпьютера</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.СвойстваКомпьютеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОперативныеЗадачиКР/src/Documents/ПродажаКомпьютера/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ПолучитьДанныеПоЗаказу();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоЗаказу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Клиент,
	|	ЗаказПокупателя.Компьютер
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Заказ";

	Запрос.УстановитьПараметр("Заказ", Объект.ДокументОснование);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Объект.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Объект.Компьютер = ВыборкаДетальныеЗаписи.Компьютер;

	Иначе	
		
		Объект.Клиент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.Компьютер = Справочники.Компьютеры.ПустаяСсылка();
		
	КонецЕсли;;
	
КонецПроцедуры
